ut/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

ut/src/CommonModules/ОблачныеКлассификаторыУТ/Module.bsl
#Область ПрограммныйИнтерфейс

#Область КлассификаторТНВЭД

// См. ОблачныеКлассификаторыПереопределяемый.ОпределитьЗагруженныеЭлементыТНВЭД.
Процедура ОпределитьЗагруженныеЭлементыТНВЭД(Элементы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторТНВЭД.Код КАК Код
	|ИЗ
	|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.Добавить(Выборка.Код);
	КонецЦикла;
	
КонецПроцедуры

// См. ОблачныеКлассификаторыПереопределяемый.СоздатьОбновитьЭлементыТНВЭД.
Процедура СоздатьОбновитьЭлементыТНВЭД(ДанныеСервиса, Отказ) Экспорт
	
	Справочники.КлассификаторТНВЭД.СоздатьОбновитьЭлементыТНВЭДИзОблачногоКлассификатора(ДанныеСервиса, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область КлассификаторОКПД2

// См. ОблачныеКлассификаторыПереопределяемый.ОпределитьЗагруженныеЭлементыОКПД2.
Процедура ОпределитьЗагруженныеЭлементыОКПД2(ЭлементыКлассификатора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторОКПД2.Код КАК Код
	|ИЗ
	|	Справочник.КлассификаторОКПД2 КАК КлассификаторОКПД2";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЭлементыКлассификатора.Добавить(Выборка.Код);
	КонецЦикла;
	
КонецПроцедуры	

// См. ОблачныеКлассификаторыПереопределяемый.СоздатьОбновитьЭлементыОКПД2.
Процедура СоздатьОбновитьЭлементыОКПД2(ДанныеСервиса, Отказ) Экспорт
	
	Справочники.КлассификаторОКПД2.СоздатьОбновитьЭлементыОКПД2ИзОблачногоКлассификатора(ДанныеСервиса, Отказ);
	
КонецПроцедуры	

#КонецОбласти

#Область КлассификаторОКЕИ

// См. ОблачныеКлассификаторыПереопределяемый.ОпределитьЗагруженныеЭлементыОКЕИ.
Процедура ОпределитьЗагруженныеЭлементыОКЕИ(СсылкиПоКоду, ДополнительныеПараметры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕдиницыИзмерения.Код КАК Код,
		|	ЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	ЕдиницыИзмерения.Код <> """"";
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		Отбор = Неопределено;
		ДополнительныеПараметры.Свойство("Отбор", Отбор);
		
		Если ЗначениеЗаполнено(Отбор) Тогда
			Запрос.Текст = Запрос.Текст + 
				"	И ЕдиницыИзмерения.ТипИзмеряемойВеличины В (&Отбор)";
			Запрос.УстановитьПараметр("Отбор", Отбор);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока ВыборкаДанных.Следующий() Цикл
		СсылкиПоКоду.Вставить(СокрЛП(ВыборкаДанных.Код), ВыборкаДанных.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

// См. ОблачныеКлассификаторыПереопределяемый.ПроверитьЭлементОКЕИ.
Процедура ПроверитьЭлементОКЕИ(Строка, ДополнительныеПараметры = Неопределено, Отказ = Ложь) Экспорт
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		Отбор = Неопределено;
		ДополнительныеПараметры.Свойство("Отбор", Отбор);
		
		Если ЗначениеЗаполнено(Отбор) Тогда
			ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.ПустаяСсылка();
			Если ЗначениеЗаполнено(Строка.ТипИзмеряемойВеличины) Тогда 
				ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин[СтрЗаменить(Строка.ТипИзмеряемойВеличины, " ", "")];
			КонецЕсли;
			
			Если ТипЗнч(Отбор) = Тип("Массив") Тогда
				Отказ = (Отбор.Найти(ТипИзмеряемойВеличины) = Неопределено);
			Иначе
				Отказ = (Отбор <> ТипИзмеряемойВеличины);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// См. ОблачныеКлассификаторыПереопределяемый.СоздатьОбновитьЭлементОКЕИ.
Процедура СоздатьОбновитьЭлементОКЕИ(ДанныеСервиса, Ссылка = Неопределено, ЭтоНовый = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(ДанныеСервиса.Ссылка) Тогда
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(Метаданные.Справочники.УпаковкиЕдиницыИзмерения.ПолноеИмя());
		ЭлементБлокировки.УстановитьЗначение("Ссылка", ДанныеСервиса.Ссылка);
		Блокировка.Заблокировать();
		
		СправочникОбъект = ДанныеСервиса.Ссылка.ПолучитьОбъект();
		Если Не СправочникОбъект.Владелец = Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения Тогда
			Возврат;
		КонецЕсли;
		
	Иначе
		ЭтоНовый = Истина;
		
		СправочникОбъект = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
		СправочникОбъект.Владелец = Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСервиса.УсловноеОбозначениеНациональное) Тогда
		Наименование = ДанныеСервиса.УсловноеОбозначениеНациональное;
	ИначеЕсли ЗначениеЗаполнено(ДанныеСервиса.УсловноеОбозначениеМеждународное) Тогда
		Наименование = ДанныеСервиса.УсловноеОбозначениеМеждународное;
	ИначеЕсли ЗначениеЗаполнено(ДанныеСервиса.КодовоеБуквенноеОбозначениеНациональное) Тогда
		Наименование = ДанныеСервиса.КодовоеБуквенноеОбозначениеНациональное;
	ИначеЕсли ЗначениеЗаполнено(ДанныеСервиса.КодовоеБуквенноеОбозначениеМеждународное) Тогда
		Наименование = ДанныеСервиса.КодовоеБуквенноеОбозначениеМеждународное;
	Иначе
		Наименование = ДанныеСервиса.Наименование;
	КонецЕсли;
	
	СправочникОбъект.Код                     = СокрЛП(ДанныеСервиса.Код);
	СправочникОбъект.Наименование            = СтрЗаменить(Наименование,Символы.ПС, "/");
	СправочникОбъект.МеждународноеСокращение = СтрЗаменить(ДанныеСервиса.КодовоеБуквенноеОбозначениеМеждународное, Символы.ПС, "/");
	СправочникОбъект.НаименованиеПолное      = СтрЗаменить(ДанныеСервиса.Наименование,Символы.ПС, "/");
	СправочникОбъект.Числитель               = ДанныеСервиса.Числитель;
	СправочникОбъект.Знаменатель             = ДанныеСервиса.Знаменатель;
	
	Если ЗначениеЗаполнено(ДанныеСервиса.ТипИзмеряемойВеличины) Тогда
		СправочникОбъект.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин[СтрЗаменить(ДанныеСервиса.ТипИзмеряемойВеличины, " ", "")];
	КонецЕсли;
	
	СправочникОбъект.Записать();
	
	Ссылка = СправочникОбъект.Ссылка;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
